/*
  【程序36】  =)
题目：有n个整数，使其前面各数顺序向后移m个位置，最后m个数变成最前面的m个数 
【程序37】           =)
题目：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下 

的是原来第几号的那位。 
【程序38】          =)
题目：写一个函数，求一个字符串的长度，在main函数中输入字符串，并输出其长度。 )
【程序39】         =)
题目：编写一个函数，输入n为偶数时，调用函数求1/2+1/4+...+1/n,当输入n为奇数时，调用函数 
               ??????????????
1/1+1/3+...+1/n??(利用指针函数)??
【程序40】After   ??????????????
0   
【程序41】??
题目：海滩上有一堆桃子，五只猴子来分。第一只猴子把这堆桃子凭据分为五份，多了一个，这只猴子把多的一 

个扔入海中，拿走了一份。第二只猴子把剩下的桃子又平均分成五份，又多了一个，它同样把多的一个扔入海中 

，拿走了一份，第三、第四、第五只猴子都是这样做的，问海滩上原来最少有多少个桃子？ 

【程序42】 
题目：809*??=800*??+9*??+1 
其中??代表的两位数,8*??的结果为两位数，9*??的结果为3位数。求??代表的两位数，及809*??后的结果。 
【程序43】 
题目：求0—7所能组成的奇数个数。 
【程序44】 
题目：一个偶数总能表示为两个素数之和。 
【程序45】 
题目：判断一个素数能被几个9整除 
【程序46】 
题目：两个字符串连接程序                         |> 
【程序47】                                                 |
题目：读取7个数（1—50）的整数值，每读取一个值，程序打印出该值个数的＊。 
【程序48】 
题目：某个公司采用公用电话传递数据，数据是四位的整数，在传递过程中是加密的，加密规则如下：每位数字 

都加上5,然后用和除以10的余数代替该数字，再将第一位和第四位交换，第二位和第三位交换。 

【程序49】 
题目：计算字符串中子串出现的次数 
【程序50】 
题目：有五个学生，每个学生有3门课的成绩，从键盘输入以上数据（包括学生号，姓名，三门课成绩），计算 

出平均成绩，况原有的数据和计算出的平均分数存放在磁盘文件"stud"中。*/