-- Oracle的sql语句练习题

--1、选择部门30中的雇员

--2、列出所有办事员的'姓名、编号和部门

--3、找出佣金高于薪金的雇员

--4、找出佣金高于薪金60%的雇员

--5、找出部门10中所有经理和部门20中的所有办事员的详细资料

--6、找出部门10中所有经理、部门20中所有办事员，既不是经理又不是办事员但其薪金>=2000的所有雇员的详细资料

--7、找出收取佣金的雇员的不同工作

--8、找出不收取佣金或收取的佣金低于100的雇员

--9、找出各月最后一天受雇的所有雇员

--10、找出早于25年之前受雇的雇员


----------------- 增删改扩展题 ----------------------------

-- 1. 添加安保部, 员工包括: 鲁智深, 秦明, 宋江 (工资,入职时间随便)

-- 2. 添加网路部, 员工包括: 公孙胜(工资,入职时间随便)

-- 3. 将安保部的鲁智深调到网络部, 并给其加工资300

-- 4. 将安保部和网络部的员工对调

-- 5. 将安保部工资低于1000的员工加薪500

-- 6. 解雇所有安保部和网络部工资大于4000的员工
